{
  "intro": "A classic French recipe of bun-less burger & chips, that can be found in every brasserie and bistro. Kids will love it and it's easy to create together at home.",
  "ingredients": [
  "FOR THE STEAK AND SAUCE"
  "1 tbsp vegetable oil"
  "4 shallots, very finely chopped"
  "600g freshly ground beef(ask the butcher for something with roughly 15% fat - we used chuck)"
  "8 thyme sprigs, leaves picked and chopped"
  "2 tsp Dijon mustard"
  "2 tbsp plain flour"
  "200ml crème fraîche"
  "1 egg yolk"
  "6 tarragon sprigs, leaves picked and finely chopped"
  "dressed green salad, to serve"
  "FOR THE POMMES FRITES"
  "4 large baking potatoes (such as Maris Piper or Russet), peeled"
  "2 tbsp vegetable oil"
  "steps": [
  "Heat the oil in a pan and add about 3 /4 of the shallots. Cook for 5-10 mins, stirring occasionally, until soft and starting to caramelise in places. Set aside to cool."

  "In a large bowl, combine the beef, thyme, 1 tsp Dijon and the cooled shallots. Season with black pepper but not salt at this stage (this can cause the meat to dry out). Shape into four patties and dust with flour. Put on a plate, cover with cling film and chill for at least 30 mins (or up to 2 hrs)."
  "Meanwhile, prepare the frites. Slice the potatoes into skinny chips, tipping into a large bowl of cold water as you go. Drain, then transfer to a large pan and cover with fresh water, seasoning with salt. Bring to a fast simmer, boil for 1 min, then drain well. Tip the chips onto a clean tea towel or some kitchen paper, spread in a single layer so they dry and cool quickly. Heat oven to 200C/180C fan/gas 6."
  "Tip the chips into a bowl with the vegetable oil and 1 tsp salt. Toss to coat, then spread out over two large baking trays. Cook for 45 mins or until crisp and golden."
  "When the chips are about 15 mins from being cooked, heat a large frying pan with a drizzle of oil. Season the patties with salt on both sides and cook for 3-4 mins each side, or until they have a dark brown crust but are still slightly pink inside (or cook them for a little longer if you’d prefer them well done). Transfer to a plate, cover with foil and set aside to keep warm while you make the sauce."
  "Return the pan to the heat and tip in the remaining shallots. Fry for 1-2 mins to soften, then remove the pan from the heat and stir in the crème fraîche, remaining Dijon, the egg yolk and tarragon, as well as any resting juices from the beef patties. Season well. Serve the steak with the pommes frites and a green salad, with the Béarnaise sauce on the side."
      ],
  "outro": "Serve with chips and salad of choice."
}
