{
  "intro": "A hidden layer of bacon makes this traditional Scotch egg recipe extra special.",
  "ingredients": [
  "12 large eggs"
  "800g good-quality Cumberland or Lincolnshire sausages, skinned"
  "5 tbsp curly parsley, finely chopped"
  "2 tsp Worcestershire sauce"
  "2 tsp English mustard powder"
  "2 tsp ground mace"
  "12 rashers smoked streaky bacon"
  "85g plain flour"
  "140-200g/5-7oz dried breadcrumbs"
  "about 1 litre/1¾ pints sunflower or vegetable oil, for frying"
  "scraps of bread, for testing oil"
  "steps": [
    "Put 9 eggs into a large saucepan. Cover with cold water and bring to the boil. Once boiling, set the timer for 5 mins. When 5 mins is up, quickly lift the eggs out with a slotted spoon and plunge into a big bowl of cold water."
    "Put the sausage-meat, parsley, Worcestershire sauce, mustard powder and mace into a bowl with plenty of seasoning. Break in 1 of the remaining eggs and mix everything together."
    "Crack remaining 2 eggs into a bowl, beat with a fork, then sieve onto a plate. Tip the flour onto another plate and season well. Finally, tip the breadcrumbs onto a third plate."
    "Bring a large saucepan of water to the boil. Drop in the bacon rashers, turn off the pan and fish out the bacon with a pair of tongs – it should be just cooked."
    "When the eggs are cool, tap lightly on a hard surface to crack the shell, then peel. If you hold the eggs over the bowl of water as you peel, all the shell bits will collect in there and you can dip in the egg to wash off any fragments. Wrap a slice of bacon around the middle of each egg, overlapping, like a belt."
    "Now finish coating the eggs. I set up the ingredients along my bench like a conveyer belt: eggs, then flour, mince, beaten egg and finally breadcrumbs, plus a baking parchment-lined tray at the end to put the finished scotch eggs on."
    "Roll your bacon-wrapped eggs in the flour, shaking off excess. Take a good chunk of mince and pat out to thinly cover one hand. Sit the egg on the meat, then mould over the mince to cover, squeezing and patting so it is an even thickness. You’ll probably have a gap (depending on how big your hands are – just patch and pat with a bit more mince). Dip in the egg, shaking off the excess, then roll in the breadcrumbs to coat, and transfer to your tray. Repeat to cover all 9 eggs, then cover with cling film and chill for 4 hrs or overnight."
    "To cook, pour the oil in a large, deep saucepan to about 4cm deep. Heat until a small chunk of bread browns in about 1 min. Carefully lower in a scotch egg and fry for about 5 mins, turning gently, until evenly browned. Depending on your pan, you can probably do 2-3 at a time, but don’t overcrowd. Lift out onto a kitchen paper-lined tray. (If you like your scotch eggs warm, pop them into a low oven while you fry the rest.) keep an eye on the oil – if the scotch eggs start browning too quickly, the oil might be too hot and you risk the pork not being cooked before the scotch egg is browned. If the oil gets too cool, the scotch egg may overcook before it is browned. enjoy warm or cold; best eaten within 24 hrs of frying."
        ],
  "outro": "Serve warm or cold as side dish"
}
